# Переводчик кода Морзе

line = '\n################# ################# #################'

'''
Радиожаргоны:

GM, GA, GE, GN (от good morning, good afternoon, good evening, good night), ЗДР — приветствие;
CQ (вероятно, от seek you) — общий вызов;
DE (далее позывной) — это такой-то (от такого-то);
GB (от good bye), ДСВ — до свидания;
K (от key — ключ, работать ключом) — передавайте, перехожу на приём;
PSE (от please) — пожалуйста;
QRZ? — кто меня вызывает?;
QRS — передавайте медленнее;
QRQ — передавайте быстрее;
R (от roger that) — вас понял;
TKS, TNX (от thanks), СПБ, БЛГ — спасибо;
73 — наилучшие пожелания

'''


def main():
    print('\n               === Morse Translate ===')
    print(line)


if __name__ == "__main__":
	main()