# XOR

##########
# 0 - 000
# 1 - 001
# 2 - 010
# 3 - 011
# 4 - 100
# 5 - 101
# 6 - 110
# 7 - 111
# 8  - 1000
# 9  - 1001
# 10 - 1010
# 11 - 1011
# 12 - 1100
# 13 - 1101
# 14 - 1110
# 15 - 1111

'''
a = 3   # 011
b = 5   # 101
        # =
        # 110
'''

while True:
    print("=== === ===")
    a = int(input("a = "))
    b = int(input("b = "))

    res = a ^ b

    print(f"{a} XOR {b} = {res}\n")

# original = res ^ b
# print(f"\nИсходное число после операции XOR с числом b ({b}):\n {res} XOR {b} = {original}")